Merge pull request #23 from CloudCarpentry/enhance-architecture-docs-and-build-tools-12565677134047251705
Enhance Architecture Docs and Build Tools
